tutorials/13InterFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    outlet
    {
        type            patch;
        nFaces          800;
        startFace       292981;
    }
    inlet
    {
        type            patch;
        nFaces          800;
        startFace       293781;
    }
    atmosphere
    {
        type            patch;
        nFaces          2956;
        startFace       294581;
    }
    side
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          2400;
        startFace       297537;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          1875;
        startFace       299937;
    }
    midplane
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          3977;
        startFace       301812;
    }
    hull
    {
        type            wall;
        inGroups        1(wall);
        nFaces          3602;
        startFace       305789;
    }
)

// ************************************************************************* //
