tutorials/13InterFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
convertToMeters 1;

vertices
(
    (-1. -0.5 -0.5)
    ( 0.5 -0.5 -0.5)
    ( 0.5  0. -0.5)
    (-1.  0. -0.5)
    (-1. -0.5  0.0399)
    ( 0.5 -0.5 0.0399)
    ( 0.5  0.  0.0399)
    (-1.  0.  0.0399)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (75 25 28) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }

    side
    {
        type symmetryPlane;
        faces
        (
            (1 5 4 0)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }

    midplane
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }
);
